; domain
(define (domain puzzle)
    (:requirements
        :strips :equality :typing
    )
    (:predicates
        (tile ?x) (position ?x)
        (at ?t ?x ?y) (blank ?x ?y)
        (add ?new ?pre) (sub ?new ?pre))
    (:action left
    :parameters (?t ?x ?y ?y_new)
    :precondition (
        and (tile ?t) (position ?x) (position ?y) (position ?y_new)
    	    (sub ?y_new ?y) (blank ?x ?y_new) (at ?t ?x ?y))
    :effect (
        and (not (blank ?x ?y_new)) (not (at ?t ?x ?y))
            (blank ?x ?y) (at ?t ?x ?y_new)))
    (:action right
    :parameters (?t ?x ?y ?y_new)
    :precondition (
        and (tile ?t) (position ?x) (position ?y) (position ?y_new)
    	    (add ?y_new ?y) (blank ?x ?y_new) (at ?t ?x ?y))
    :effect (
        and (not (blank ?x ?y_new)) (not (at ?t ?x ?y))
            (blank ?x ?y) (at ?t ?x ?y_new)))
    (:action up
    :parameters (?t ?x ?y ?x_new)
    :precondition (
        and (tile ?t) (position ?x) (position ?y) (position ?x_new)
    	    (sub ?x_new ?x) (blank ?x_new ?y) (at ?t ?x ?y))
    :effect (
        and (not (blank ?x_new ?y)) (not (at ?t ?x ?y))
    	    (blank ?x ?y) (at ?t ?x_new ?y))) 
    (:action down
    :parameters (?t ?x ?y ?x_new)
    :precondition (and
    	   (tile ?t) (position ?x) (position ?y) (position ?x_new)
    	   (add ?x_new ?x) (blank ?x_new ?y) (at ?t ?x ?y))
    :effect (and (not (blank ?x_new ?y)) (not (at ?t ?x ?y))
    	 (blank ?x ?y) (at ?t ?x_new ?y)))
)

; problem
(define (problem prob)
    (:domain puzzle)
    (:objects t1 t2 t3 t4 t5 t6 t7 t8 p1 p2 p3 q1 q2 q3)
    (:init (tile t1) (tile t2) (tile t3) (tile t4)
           (tile t5) (tile t6) (tile t7) (tile t8)
           (position p1) (position p2) 
           (position p3) (position q1) 
           (position q2) (position q3)
           (blank p2 q3)
           (at t1 p1 q1) (at t2 p1 q2) (at t3 p1 q3) (at t7 p2 q1)
           (at t8 p2 q2) (at t6 p3 q1) (at t4 p3 q2) (at t5 p3 q3)
           (add p2 p1) (add p3 p2) (sub p1 p2) (sub p2 p3)
           (add q2 q1) (add q3 q2) (sub q1 q2) (sub q2 q3)
           )
    (:goal (
        and (at t1 p1 q1) (at t2 p1 q2) (at t3 p1 q3) (at t4 p2 q1)
            (at t5 p2 q2) (at t6 p2 q3) (at t7 p3 q1) (at t8 p3 q2)
            (blank p3 q3)
    )))

; plan
1. (up t5 p3 q3 p2)
   deleted: (blank p2 q3) (at t5 p3 q3)
   added: (blank p3 q3) (at t5 p2 q3)
   goals met: 4 of 9
2. (right t4 p3 q2 q3)
   deleted: (blank p3 q3) (at t4 p3 q2)
   added: (blank p3 q2) (at t4 p3 q3)
   goals met: 3 of 9
3. (down t8 p2 q2 p3)
   deleted: (blank p3 q2) (at t8 p2 q2)
   added: (blank p2 q2) (at t8 p3 q2)
   goals met: 4 of 9
4. (left t5 p2 q3 q2)
   deleted: (blank p2 q2) (at t5 p2 q3)
   added: (blank p2 q3) (at t5 p2 q2)
   goals met: 5 of 9
5. (up t4 p3 q3 p2)
   deleted: (blank p2 q3) (at t4 p3 q3)
   added: (blank p3 q3) (at t4 p2 q3)
   goals met: 6 of 9
6. (right t8 p3 q2 q3)
   deleted: (blank p3 q3) (at t8 p3 q2)
   added: (blank p3 q2) (at t8 p3 q3)
   goals met: 4 of 9
7. (right t6 p3 q1 q2)
   deleted: (blank p3 q2) (at t6 p3 q1)
   added: (blank p3 q1) (at t6 p3 q2)
   goals met: 4 of 9
8. (down t7 p2 q1 p3)
   deleted: (blank p3 q1) (at t7 p2 q1)
   added: (blank p2 q1) (at t7 p3 q1)
   goals met: 5 of 9
9. (left t5 p2 q2 q1)
   deleted: (blank p2 q1) (at t5 p2 q2)
   added: (blank p2 q2) (at t5 p2 q1)
   goals met: 4 of 9
10. (up t6 p3 q2 p2)
   deleted: (blank p2 q2) (at t6 p3 q2)
   added: (blank p3 q2) (at t6 p2 q2)
   goals met: 4 of 9
11. (left t8 p3 q3 q2)
   deleted: (blank p3 q2) (at t8 p3 q3)
   added: (blank p3 q3) (at t8 p3 q2)
   goals met: 6 of 9
12. (down t4 p2 q3 p3)
   deleted: (blank p3 q3) (at t4 p2 q3)
   added: (blank p2 q3) (at t4 p3 q3)
   goals met: 5 of 9
13. (right t6 p2 q2 q3)
   deleted: (blank p2 q3) (at t6 p2 q2)
   added: (blank p2 q2) (at t6 p2 q3)
   goals met: 6 of 9
14. (down t2 p1 q2 p2)
   deleted: (blank p2 q2) (at t2 p1 q2)
   added: (blank p1 q2) (at t2 p2 q2)
   goals met: 5 of 9
15. (left t3 p1 q3 q2)
   deleted: (blank p1 q2) (at t3 p1 q3)
   added: (blank p1 q3) (at t3 p1 q2)
   goals met: 4 of 9
16. (up t6 p2 q3 p1)
   deleted: (blank p1 q3) (at t6 p2 q3)
   added: (blank p2 q3) (at t6 p1 q3)
   goals met: 3 of 9
17. (up t4 p3 q3 p2)
   deleted: (blank p2 q3) (at t4 p3 q3)
   added: (blank p3 q3) (at t4 p2 q3)
   goals met: 4 of 9
18. (right t8 p3 q2 q3)
   deleted: (blank p3 q3) (at t8 p3 q2)
   added: (blank p3 q2) (at t8 p3 q3)
   goals met: 2 of 9
19. (down t2 p2 q2 p3)
   deleted: (blank p3 q2) (at t2 p2 q2)
   added: (blank p2 q2) (at t2 p3 q2)
   goals met: 2 of 9
20. (left t4 p2 q3 q2)
   deleted: (blank p2 q2) (at t4 p2 q3)
   added: (blank p2 q3) (at t4 p2 q2)
   goals met: 2 of 9
21. (down t6 p1 q3 p2)
   deleted: (blank p2 q3) (at t6 p1 q3)
   added: (blank p1 q3) (at t6 p2 q3)
   goals met: 3 of 9
22. (right t3 p1 q2 q3)
   deleted: (blank p1 q3) (at t3 p1 q2)
   added: (blank p1 q2) (at t3 p1 q3)
   goals met: 4 of 9
23. (up t4 p2 q2 p1)
   deleted: (blank p1 q2) (at t4 p2 q2)
   added: (blank p2 q2) (at t4 p1 q2)
   goals met: 4 of 9
24. (right t5 p2 q1 q2)
   deleted: (blank p2 q2) (at t5 p2 q1)
   added: (blank p2 q1) (at t5 p2 q2)
   goals met: 5 of 9
25. (down t1 p1 q1 p2)
   deleted: (blank p2 q1) (at t1 p1 q1)
   added: (blank p1 q1) (at t1 p2 q1)
   goals met: 4 of 9
26. (left t4 p1 q2 q1)
   deleted: (blank p1 q1) (at t4 p1 q2)
   added: (blank p1 q2) (at t4 p1 q1)
   goals met: 4 of 9
27. (up t5 p2 q2 p1)
   deleted: (blank p1 q2) (at t5 p2 q2)
   added: (blank p2 q2) (at t5 p1 q2)
   goals met: 3 of 9
28. (up t2 p3 q2 p2)
   deleted: (blank p2 q2) (at t2 p3 q2)
   added: (blank p3 q2) (at t2 p2 q2)
   goals met: 3 of 9
29. (right t7 p3 q1 q2)
   deleted: (blank p3 q2) (at t7 p3 q1)
   added: (blank p3 q1) (at t7 p3 q2)
   goals met: 2 of 9
30. (down t1 p2 q1 p3)
   deleted: (blank p3 q1) (at t1 p2 q1)
   added: (blank p2 q1) (at t1 p3 q1)
   goals met: 2 of 9
31. (down t4 p1 q1 p2)
   deleted: (blank p2 q1) (at t4 p1 q1)
   added: (blank p1 q1) (at t4 p2 q1)
   goals met: 3 of 9
32. (left t5 p1 q2 q1)
   deleted: (blank p1 q1) (at t5 p1 q2)
   added: (blank p1 q2) (at t5 p1 q1)
   goals met: 3 of 9
33. (up t2 p2 q2 p1)
   deleted: (blank p1 q2) (at t2 p2 q2)
   added: (blank p2 q2) (at t2 p1 q2)
   goals met: 4 of 9
34. (right t4 p2 q1 q2)
   deleted: (blank p2 q2) (at t4 p2 q1)
   added: (blank p2 q1) (at t4 p2 q2)
   goals met: 3 of 9
35. (up t1 p3 q1 p2)
   deleted: (blank p2 q1) (at t1 p3 q1)
   added: (blank p3 q1) (at t1 p2 q1)
   goals met: 3 of 9
36. (left t7 p3 q2 q1)
   deleted: (blank p3 q1) (at t7 p3 q2)
   added: (blank p3 q2) (at t7 p3 q1)
   goals met: 4 of 9
37. (down t4 p2 q2 p3)
   deleted: (blank p3 q2) (at t4 p2 q2)
   added: (blank p2 q2) (at t4 p3 q2)
   goals met: 4 of 9
38. (right t1 p2 q1 q2)
   deleted: (blank p2 q2) (at t1 p2 q1)
   added: (blank p2 q1) (at t1 p2 q2)
   goals met: 4 of 9
39. (down t5 p1 q1 p2)
   deleted: (blank p2 q1) (at t5 p1 q1)
   added: (blank p1 q1) (at t5 p2 q1)
   goals met: 4 of 9
40. (left t2 p1 q2 q1)
   deleted: (blank p1 q1) (at t2 p1 q2)
   added: (blank p1 q2) (at t2 p1 q1)
   goals met: 3 of 9
41. (up t1 p2 q2 p1)
   deleted: (blank p1 q2) (at t1 p2 q2)
   added: (blank p2 q2) (at t1 p1 q2)
   goals met: 3 of 9
42. (right t5 p2 q1 q2)
   deleted: (blank p2 q2) (at t5 p2 q1)
   added: (blank p2 q1) (at t5 p2 q2)
   goals met: 4 of 9
43. (down t2 p1 q1 p2)
   deleted: (blank p2 q1) (at t2 p1 q1)
   added: (blank p1 q1) (at t2 p2 q1)
   goals met: 4 of 9
44. (left t1 p1 q2 q1)
   deleted: (blank p1 q1) (at t1 p1 q2)
   added: (blank p1 q2) (at t1 p1 q1)
   goals met: 5 of 9
45. (up t5 p2 q2 p1)
   deleted: (blank p1 q2) (at t5 p2 q2)
   added: (blank p2 q2) (at t5 p1 q2)
   goals met: 4 of 9
46. (right t2 p2 q1 q2)
   deleted: (blank p2 q2) (at t2 p2 q1)
   added: (blank p2 q1) (at t2 p2 q2)
   goals met: 4 of 9
47. (up t7 p3 q1 p2)
   deleted: (blank p2 q1) (at t7 p3 q1)
   added: (blank p3 q1) (at t7 p2 q1)
   goals met: 3 of 9
48. (left t4 p3 q2 q1)
   deleted: (blank p3 q1) (at t4 p3 q2)
   added: (blank p3 q2) (at t4 p3 q1)
   goals met: 3 of 9
49. (down t2 p2 q2 p3)
   deleted: (blank p3 q2) (at t2 p2 q2)
   added: (blank p2 q2) (at t2 p3 q2)
   goals met: 3 of 9
50. (right t7 p2 q1 q2)
   deleted: (blank p2 q2) (at t7 p2 q1)
   added: (blank p2 q1) (at t7 p2 q2)
   goals met: 3 of 9
51. (up t4 p3 q1 p2)
   deleted: (blank p2 q1) (at t4 p3 q1)
   added: (blank p3 q1) (at t4 p2 q1)
   goals met: 4 of 9
52. (left t2 p3 q2 q1)
   deleted: (blank p3 q1) (at t2 p3 q2)
   added: (blank p3 q2) (at t2 p3 q1)
   goals met: 4 of 9
53. (down t7 p2 q2 p3)
   deleted: (blank p3 q2) (at t7 p2 q2)
   added: (blank p2 q2) (at t7 p3 q2)
   goals met: 4 of 9
54. (down t5 p1 q2 p2)
   deleted: (blank p2 q2) (at t5 p1 q2)
   added: (blank p1 q2) (at t5 p2 q2)
   goals met: 5 of 9
55. (right t1 p1 q1 q2)
   deleted: (blank p1 q2) (at t1 p1 q1)
   added: (blank p1 q1) (at t1 p1 q2)
   goals met: 4 of 9
56. (up t4 p2 q1 p1)
   deleted: (blank p1 q1) (at t4 p2 q1)
   added: (blank p2 q1) (at t4 p1 q1)
   goals met: 3 of 9
57. (up t2 p3 q1 p2)
   deleted: (blank p2 q1) (at t2 p3 q1)
   added: (blank p3 q1) (at t2 p2 q1)
   goals met: 3 of 9
58. (left t7 p3 q2 q1)
   deleted: (blank p3 q1) (at t7 p3 q2)
   added: (blank p3 q2) (at t7 p3 q1)
   goals met: 4 of 9
59. (down t5 p2 q2 p3)
   deleted: (blank p3 q2) (at t5 p2 q2)
   added: (blank p2 q2) (at t5 p3 q2)
   goals met: 3 of 9
60. (right t2 p2 q1 q2)
   deleted: (blank p2 q2) (at t2 p2 q1)
   added: (blank p2 q1) (at t2 p2 q2)
   goals met: 3 of 9
61. (down t4 p1 q1 p2)
   deleted: (blank p2 q1) (at t4 p1 q1)
   added: (blank p1 q1) (at t4 p2 q1)
   goals met: 4 of 9
62. (left t1 p1 q2 q1)
   deleted: (blank p1 q1) (at t1 p1 q2)
   added: (blank p1 q2) (at t1 p1 q1)
   goals met: 5 of 9
63. (up t2 p2 q2 p1)
   deleted: (blank p1 q2) (at t2 p2 q2)
   added: (blank p2 q2) (at t2 p1 q2)
   goals met: 6 of 9
64. (up t5 p3 q2 p2)
   deleted: (blank p2 q2) (at t5 p3 q2)
   added: (blank p3 q2) (at t5 p2 q2)
   goals met: 7 of 9
65. (left t8 p3 q3 q2)
   deleted: (blank p3 q2) (at t8 p3 q3)
   added: (blank p3 q3) (at t8 p3 q2)
   goals met: 9 of 9
